-- translation for StandardPackage

local t = {
	["standard"] = "西游杀",
	["standard_cards"] = "游戏卡牌包",
	["maneuvering"] = "卡牌扩展包",
	["standard_ex_cards"] = "卡牌扩展包",
	["buff_card"] = "辅助伤害卡",
	["damage_spread"] = "伤害传导",

	["attack_card"] = "进攻牌",
	["defense_card"] = "防御牌",
	["recover_card"] = "恢复牌",
	["global_effect"] = "全局效果",
	["aoe"] = "范围效果",
	["single_target_trick"] = "单体法术",
	["delayed_trick"] = "延时法术",
	["weapon"] = "法宝·武器",
	["armor"] = "法宝·防具",
	["horse"] = "坐骑",
	["defensive_horse"] = "防御坐骑",
	["offensive_horse"] = "进攻坐骑",

	["slash"] = "风劫",
	[":slash"] = "基本牌，出牌阶段，对除你外，你攻击范围内的一名角色使用，若目标无法躲避，则你对其造成1点伤害。\
	任何时候，当你成为【决斗】或【万劫不复】的目标时，你可以打出【劫】来抵消其效果。",

	["jink"] = "遁",
	[":jink"] = "基本牌，任何时候，当你成为【劫】或者【天罗地网】的目标开始结算时，你可以打出【遁】来抵消其效果。",

	["peach"] = "蟠桃",
	[":peach"] = "基本牌，出牌阶段，对自己使用，可使自己回复一格元阳。\
	任何时候，有角色处于濒死状态时，对其使用，可使目标角色回复1点体力。",

	["duel"] = "决斗",
	[":duel"] = "法术牌，出牌阶段，对除你以外任意一名角色使用，由目标角色先开始，你和他（她）轮流打出一张【劫】，【决斗】对首先不出【劫】的一方造成1点伤害；另一方成为此伤害的来源。",

	["dismantlement"] = "丢盔弃甲",
	[":dismantlement"] = "法术牌，出牌阶段，对除你以外任意一名角色使用，你选择并弃掉目标角色手牌（随机选择）、装备区或问卜区里的一张牌。",

	["snatch"] = "隐身术",
	[":snatch"] = "法术牌，出牌阶段，对除你以外与你距离1以内的一名角色使用，你可以选择并获得目标角色手牌（随机选择）、装备区或问卜区里的一张牌。",

	["archery_attack"] = "天罗地网",
	[":archery_attack"] = "法术牌，出牌阶段，对除你以外的所有角色使用，按行动顺序结算，目标角色需打出1张【闪】来响应，否则该角色受到1点伤害。",

	["savage_assault"] = "万劫不复",
	[":savage_assault"] = "法术牌，出牌阶段，对除你以外的所有角色使用，按行动顺序结算，目标角色需打出1张【劫】来响应，否则该角色受到1点伤害。",

	["god_salvation"] = "蟠桃大会",
	[":god_salvation"] = "法术牌，出牌阶段，对所有角色使用，按行动顺序结算，目标角色回复1点体力。",

	["ex_nihilo"] = "分身术",
	[":ex_nihilo"] = "法术牌，出牌阶段，对自己使用，可以立即摸两张牌。",

	["amazing_grace"] = "招安",
	[":amazing_grace"] = "法术牌，出牌阶段，对所有角色使用，从牌堆顶亮出等同于现存角色数量的牌，然后按行动顺序结算，目标角色选择并获得这些牌中的一张。",

	["indulgence"] = "五行山",
	[":indulgence"] = "法术牌，延时，出牌阶段，对除你以外任意一名角色使用，将【乐不思蜀】横置于目标角色问卜区里，目标角色回合问卜阶段，进行问卜：若问卜结果不为红桃，则跳过目标角色的出牌阶段，将【乐不思蜀】弃置。",

	["lightning"] = "生死簿",
	[":lightning"] = "法术牌，延时，出牌阶段，对自己使用，将【生死簿】横置于问卜区里，回合问卜阶段，进行问卜：若问卜结果为黑桃2-9之间（包括黑桃2和9），当前目标受到3点无来源的伤害，将生死簿弃置。若问卜结果不为黑桃2-9之间（包括黑桃2和9），将【生死簿】移动到当前当前角色下家（【生死簿】的目标变为该角色）的问卜区。",

	["nullification"] = "金蝉脱壳",
	[":nullification"] = "法术牌，在一张法术牌对目标角色生效前，你可以对该法术使用，抵消该法术对其指定的一名目标角色产生的效果。",

	["crossbow"] = "紫金铃",
	[":crossbow"] = "法宝·武器牌，攻击范围：１\
	法宝特效：出牌阶段，你可以使用任意张【劫】。",

	["double_sword"] = "照妖镜",
	[":double_sword"] = "法宝·武器牌，攻击范围：２\
法宝特效：你使用【劫】时，若指定了一名异性角色，则在【劫】结算前，你可以令对方选择一项：自己弃一张手牌或者让你从牌堆摸一张牌。",
	["double-sword-card"] = "%src 发动了【照妖镜】，你必须弃一张手牌或让 %src 摸一张牌",
	["double_sword:yes"] = "你可以让对方选择让你摸一张牌或自弃一张牌",

	["qinggang_sword"] = "天罡刀",
	[":qinggang_sword"] = "法宝·武器牌，攻击范围：3\
法宝特效：锁定技，每当你使用【劫】时，无视目标角色的防具法宝。",

	["blade"] = "九齿钉耙",
	[":blade"] = "法宝·武器牌，攻击范围：３\
法宝特效：当你使用的【劫】被【遁】抵消时，你可以立即对此目标再使用一张【劫】直到【劫】生效或你不愿意出了为止。",
	["blade-slash"] = "你可以发动九齿钉耙的追杀效果再打出一张【劫】",

	["spear"] = "火尖枪",
	[":spear"] = "法宝·武器牌，攻击范围：３\
法宝特效：当你需要使用（或打出）一张【劫】时，你可以将两张手牌当一张【火劫】使用（或打出）",

	["axe"] = "降妖宝铲",
	[":axe"] = "法宝·武器牌，攻击范围：2\
法宝特效：目标角色使用【遁】抵消你使用【劫】的效果时，你可以弃两张牌，则【劫】依然造成伤害。",
	["@axe"] = "你可以弃掉弃两张牌使此【劫】强制命中（手牌、装备牌均可）",
	["#AxeSkill"] = "%from 发动了<font color='yellow'><b>【降妖宝铲】</b></font>，弃掉了2张牌强制命中了 %to ",

	["halberd"] = "如意金箍棒",
	[":halberd"] = "法宝·武器牌，攻击范围：４\
法宝特效：当你使用的【劫】是你的最后一张手牌时，你可以为这张【劫】指定至多三名目标角色，然后按行动顺序依次结算之。",

	["kylin_bow"] = "金刚琢",
	[":kylin_bow"] = "法宝·武器牌，攻击范围：3\
法宝特效：你使用【劫】对目标角色造成伤害时，你可以获得其装备区里的武器。",
	["kylin_bow:yes"] = "你可以获得其武器",
	["kylin_bow:weapon"] = "法宝·武器",

	["eight_diagram"] = "五彩仙衣",
	[":eight_diagram"] = "法宝·防具牌，法宝效果：每当你需要使用（或打出）一张【遁】时，你可以进行一次问卜：\
	★若为红色，则视为你使用（或打出）了一张【遁】；\
	★若为黑色，你仍可从手牌里使用（或打出）。",
	["eight_diagram:yes"] = "进行一次问卜，若问卜结果为红色，则视为你打出了一张【遁】",

	["renwang_shield"] = "避水珠",
	[":renwang_shield"] = "法宝·防具牌，防具效果：【水劫】对你无效。",

	["qianliyan"] = "千里眼",
	[":qianliyan"] = "法术牌，出牌阶段，对除你以外有手牌的一名角色使用，观看该角色手牌。",

	["bihuo_shield"] = "辟火罩",
	[":bihuo_shield"] = "法宝·防具牌，防具效果：【火劫】对你无效。",

	["dingfeng_shield"] = "定风丹",
	[":dingfeng_shield"] = "法宝·防具牌，防具效果：【风劫】对你无效。",

	["fire_slash"] = "火劫",
	[":fire_slash"] = "基本牌，出牌阶段，对除你外，你攻击范围内的一名角色使用，若目标无法闪避，你对目标角色造成1点火焰伤害。",

	["thunder_slash"] = "水劫",
	[":thunder_slash"] = "基本牌，出牌阶段，对除你外，你攻击范围内的一名角色使用，若目标无法闪避，你对目标角色造成1点水属性伤害。",

	["supply_shortage"] = "紧箍咒",
	[":supply_shortage"] = "法术牌，出牌阶段，对除你以外，与你距离为1以内的角色使用（横置于该角色的判定区内），若其判定的结果不为梅花，则该角色跳过摸牌阶段。",

	["fan"] = "芭蕉扇",
	[":fan"] = "法宝·武器牌，攻击范围：3\
法术特效：当你使用的【风劫】对目标角色造成伤害，你可使该伤害+1。",
	["fan:yes"] = "你可使该伤害+1",

	["vine"] = "锦斓袈裟",
	[":vine"] = "法宝·防具牌，防具效果：【风劫】、【水劫】对你无效；每次受到【火劫】伤害时，该伤害+1。",
	["#VineDamage"] = "%from 的锁定技<font color='yellow'><b>【锦斓袈裟】</b></font>被触发，受到的火焰伤害由 %arg 点增加到 %arg2 点",

	["jindouyun"] = "筋斗云",
	["bishuishou"] = "辟水兽",
	["xiaotianquan"] = "哮天犬",
	["fenghuolun"] = "风火轮",
	["bailongma"] = "白龙马",
	[":-1 horse"] = "法宝·防御牌，你计算与其他角色的距离时，始终-1（你可以理解为一种进攻上的优势，不同名称的-1法宝，其效果是相同的）。",
	[":+1 horse"] = "法宝·防御牌，其他角色计算与你的距离时，始终+1（你可以理解为一种防御上的优势，不同名称的+1法宝，其效果是相同的）。",

}

local ohorses = {"fenghuolun", "bailongma", "xiaotianquan"}
local dhorses = {"jindouyun", "bishuishou"}

for _, horse in ipairs(ohorses) do
	t[":" .. horse] = t[":-1 horse"]
end

for _, horse in ipairs(dhorses) do
	t[":" .. horse] = t[":+1 horse"]
end

return t
